const junctions = [
  {
    id: "विश्वकर्मा द्वार रात्रि",
    subJunctions: ["विश्वकर्मा द्वार रात्रि"],
  },
  {
    id: "जाजमऊ चौराहा",
    subJunctions: ["बीमा चौराहा", "जे0के0 चौराहा", "जाजमऊ विश्वकर्मा द्वार"],
  },
  {
    id: "हरजेन्दर नगर",
    subJunctions: [
      "हरजेन्दर नगर",
      "पुराना थाना चकेरी",
      "मा0 वि0 सभा अध्यक्ष आवास मोड़ लाल बंगला",
      "एयरफोर्स स्टेशन",
    ],
  },
  {
    id: "रामा देवी चौराहा",
    subJunctions: [
      "एचएएल",
      "रामादेवी चौराहा",
      "रामादेवी सब्जीमण्डी",
      "ई- रिक्शा डायवर्जन (रामादेवी रैम्प के पीछे लखनऊ साइड़)",
      "ई- रिक्शा डायवर्जन (फतेहपुर साइड़)",
      "जगदंबा पेट्रोल पम्प",
      "शिवकटरा मोड",
    ],
  },
  {
    id: "अहिरवॉ",
    subJunctions: ["एयरपोर्ट कट", "अहिरवॉ"],
  },
  {
    id: "श्यामनगर चौराहा",
    subJunctions: [
      "श्याम नगर चौराहा",
      "छप्पन भोग चौराहा",
      "पीएसी पुल छप्पन भोग साइड",
      "देहली सुजानपुर कट (हंस मन्दिर)",
    ],
  },
  {
    id: "मनोज इण्टरनेशनल / पीएसी मोड",
    subJunctions: ["मनोज इन्टरनेशनल", "सीओडी पुल टाटमिल साइड"],
  },
  {
    id: "कोयला नगर",
    subJunctions: ["कोयला नगर"],
  },
  {
    id: "रामा देवी रैम्प (नौबस्ता साइड अंडर पास)",
    subJunctions: [
      "रामादेवी रैम्प (गुरू हर राय साइड)",
      "रामादेवी रैम्प (मंगलाविहार साइड)",
    ],
  },
  {
    id: "राकेट तिराहा",
    subJunctions: [
      "राकेट तिराहा",
      "10 नं0 कैन्टीन",
      "सिविल एयरो ड्रम",
      "रेलवे स्टेशन गेट नं0 1 साइड",
    ],
  },
  {
    id: "मुरे कम्पनीपुल कैण्ट साइड",
    subJunctions: ["मुरे कम्पनीपुल कैण्ट साइड"],
  },
  {
    id: "नरौना चौराहा",
    subJunctions: ["नरौना चौराहा", "मुरे कम्पनीपुल नरौनासाइड"],
  },
  {
    id: "पनचक्की चौराहा",
    subJunctions: ["पनचक्की चौराहा", "झाडीबाबा पडाव"],
  },
  {
    id: "चार्लिस चौराहा",
    subJunctions: [
      "फूलबाग चौराहा",
      "गिलिश बाजार कट",
      "चार्लिस चौराहा",
      "किला तिराहा",
    ],
  },
  {
    id: "मेघदूत",
    subJunctions: ["मेघदूत तिराहा", "व्यायामशाला"],
  },
  {
    id: "सरसैयाघाट",
    subJunctions: ["सरसैयाघाट", "पुलिस लाइन मेन गेट"],
  },
  {
    id: "बडा चौराहा",
    subJunctions: [
      "बड़ा चौराहा",
      "कोतवाली चौराहा",
      "लैण्डमार्क",
      "भार्गव हास्पिटल चौराहा",
      "आर0ओ0 प्लांट सब्जी मण्डी तिराहा वन-वे",
      "बड़ा चौराहा से कोतवाली रोड",
      "उर्सला हॉस्पीटल यू-टर्न /ठग्गू के लड्डू रोड",
    ],
  },
  {
    id: "चेतना चौराहा",
    subJunctions: [
      "चेतना चौराहा वन-वे",
      "डीएम कार्यालय गेट समय प्रात: 09.00 से 17.00 बजे तक",
      "कचहरी गेट तिराहा",
    ],
  },
  {
    id: "डीजे गेट",
    subJunctions: ["डीजे गेट समय प्रात: 09.00 से 17.00 बजे तक"],
  },
  {
    id: "महिला थाना",
    subJunctions: [
      "महिला थाना प्रातः 09.00 से 17.00 बजे तक",
      "गोरा कब्रिस्तान के पीछे",
      "महिला थाना से गोरा कब्रिस्तान पीछे गस्त प्रातः 09.00 से 17.00 बजे तक",
      "महिला थाना से लट्ठाकोठी गस्त मैन रोड साइड",
    ],
  },
  {
    id: "लट्ठा कोठी",
    subJunctions: [
      "लठ्ठा कोठी प्रातः 09.00 से 17.00 बजे तक",
      "डीएवी तिराहा प्रातः 09.00 से 17.00 बजे तक",
      "तिकोनिया पार्क",
    ],
  },
  {
    id: "ग्रीनपार्क",
    subJunctions: ["वीआईपी रोड", "ग्रीन पार्क चौराहा"],
  },
  {
    id: "एमजी कालेज",
    subJunctions: ["एमजी कालेज"],
  },
  {
    id: "पुलिस ऑफिस",
    subJunctions: [
      "पुलिस ऑफिस",
      "पुलिस ऑफिस गेट वन-वे प्रात: 09.00 से 17.00 बजे तक",
      "पुलिस ऑफिस पार्किंग प्रातः 09.00 से 17.00 बजे तक",
    ],
  },
  {
    id: "मूलगंज",
    subJunctions: [
      "मूलगंज चौराहा यू-टर्न",
      "कुली बाजार यू-टर्न मूलगंज",
      "शरमन इन्टरप्राइजेज के सामने कट",
      "श्याम बिहारी मिश्रा चौक यू-टर्न",
      "अहिंसा चौक मूलगंज",
    ],
  },
  {
    id: "कारसेट",
    subJunctions: [
      "कारसेट/ परेड चौराहा",
      "सद्भवना",
      "यतीमखाना",
      "नई सड़क",
      "किताब मार्केट/आईएमए",
    ],
  },
  {
    id: "परेड चौराहा",
    subJunctions: ["नवीन मार्केट", "म्योर मील तिराहा"],
  },
  {
    id: "सर्किट हाऊस",
    subJunctions: [
      "जयपुरिया क्रासिंग",
      "मैथाडिस्क स्कूल",
      "नया पुल उन्नाव बार्डर",
      "सर्किट हाऊस प्रातः 09.00 से 17.00 बजे तक",
    ],
  },
  {
    id: "घण्टाघर चौराहा",
    subJunctions: ["घण्टाघर चौराहा दिन", "रेलway स्टेशन गेट नं0 02"],
  },
  {
    id: "घण्टाघर चौराहा रात्रि",
    subJunctions: ["घण्टाघर चौराहा रात्रि"],
  },
  {
    id: "एक्सप्रेस रोड",
    subJunctions: [
      "हूलागंज",
      "शनिदेव मन्दिर एक्शप्रेस रोड",
      "मालगोदाम",
      "कोपरगंज",
    ],
  },
  {
    id: "कल्यानपुर क्रसिंग",
    subJunctions: [
      "कल्यानपुर क्रासिंग",
      "आरक्षण केंद्र ( कल्यानपुर क्रासिंग )",
      "बिठूर रोड तिराहा",
      "बिठूूर रोड तिराहा रात्रि",
      "गोवा गार्डेन",
    ],
  },
  {
    id: "सीएनजी पम्प पनकी रोड़ कल्याणपुर",
    subJunctions: [
      "न्यू शिवली रोड तिराहा",
      "पुराना शिवली रोड तिराहा डायवर्जन",
      "स्टेशन रोड तिराहा पुराना शिवली रोड़",
      "सीएनजी पम्प पनकी रोड़ कल्याणपुर",
    ],
  },
  {
    id: "गुरुदेव चौराहा",
    subJunctions: ["गुरुदेव चौराहा", "मैट्रो यार्ड कट"],
  },
  {
    id: "इन्द्रानगर मोड तिराहा",
    subJunctions: [
      "इन्द्रानगर मोड तिराहा",
      "बगिया क्रॉसिंग",
      "एस0पी0एम0 मैट्रो स्टेशन कट",
    ],
  },
  {
    id: "मन्धना चौराहा",
    subJunctions: [
      "मन्धना चौराहा",
      "ब्लू-वर्ड पार्क (समय 09.00 बजे से 17.00 बजे तक)",
      "रामा विश्वविद्यालय मंधना",
    ],
  },
  {
    id: "दलहन क्रॉसिंग",
    subJunctions: ["दलहन क्रॉसिंग", "विश्वविद्यालय गेट"],
  },
  {
    id: "आई0आई0टी0/नारामऊ",
    subJunctions: ["आई0आई0टी0 गेट", "एल0एम0को0 क्रॉसिंग"],
  },
  {
    id: "सिंहपुर चौराहा",
    subJunctions: ["सिंहपुर चौराहा प्रात: 09.00 से शाम 17:00 तक"],
  },
  {
    id: "कस्बा बिठूर चौराहा",
    subJunctions: ["कस्बा बिठूर चौराहा"],
  },
  {
    id: "भाटिया/पनकी /शताब्दी नगर/आवास विकास",
    subJunctions: [
      "आवास विकास नहर",
      "नो इन्ट्री भाटिया तिराहा",
      "शताब्दी द्वार पनकी",
      "शताब्दी द्वार पनकी फ्लाईओवर",
      "गंगागंज क्रासिंग पनकी",
      "पनकी सब्जी मण्डी चौराहा",
      "पनकी सब्जी मण्डी पुल के नीचे डायवर्जन",
    ],
  },
  {
    id: "भौती वाईपास चौराहा",
    subJunctions: ["भौती वाईपास चौराहा", "भौती अण्डर पास"],
  },
  {
    id: "चकरपुर मण्डी",
    subJunctions: ["चकरपुर मण्डी चौराहा"],
  },
  {
    id: "नो इंट्री अर्मापुर",
    subJunctions: ["नो इंट्री अर्मापुर", "एम0आई0जी0 तिराहा"],
  },
  {
    id: "चौबेपुर दिन",
    subJunctions: ["चौबेपुर चौराहा"],
  },
  {
    id: "बिल्हौर",
    subJunctions: ["बिल्हौर चौराहा"],
  },
  {
    id: "झकरकटी बस अड्डा",
    subJunctions: ["झकरकटी बस अड्डा"],
  },
  {
    id: "टाटमील चौराहा दिन",
    subJunctions: ["टाटमील चौराहा दिन", "लंगड़िया", "रेलवे स्टेशन मोड"],
  },
  {
    id: "टाटमिल चौराहा रात्रि/झकरकटी बसअड्डा रात्रि",
    subJunctions: [
      "टाटमिल रात्रि नोट-टीएसआई ड्यूटी समय 20.00 से 08.00 बजे तक तथा कर्म0गणों ड्यूटी समय 23.00 से 07.00 बजे तक ।",
    ],
  },
  {
    id: "यशोदा नगर चौराहा",
    subJunctions: ["यशोदा नगर चौराहा"],
  },
  {
    id: "नौबस्ता चौराहा दिन",
    subJunctions: [
      "नौबस्ता चौराहा",
      "पुरानी मौरंग मण्डी",
      "बसंत बिहार चौराहा",
      "शिवाजी पुलिया कट (नौबस्ता)",
    ],
  },
  {
    id: "नौवस्ता बम्बा",
    subJunctions: [
      "नौबस्ता बम्बा",
      "धोबिन पुलिया",
      "दासू कुआं चौराहा",
      "मछरिया कट",
      "त्रिमूर्ति अपार्टमेन्ट तिराहा",
      "समाधी पुलिया",
      "नई मौरंग मण्डी",
    ],
  },
  {
    id: "नौवस्ता चौराहा रात्रि",
    subJunctions: [
      "नौबस्ता चौराहा रात्रि नोट-टीएसआई ड्यूटी समय 20.00 से 08.00 बजे तक तथा कर्म0गणों ड्यूटी समय 23.00 से 07.00 बजे तक ।",
    ],
  },
  {
    id: "यादव मार्केट",
    subJunctions: ["यादव मार्केट चौराहा/बर्रा"],
  },
  {
    id: "बसंत पेट्रोल पम्प",
    subJunctions: ["बसंत पेट्रोल पम्प", "कार्गिल"],
  },
  {
    id: "एल0एम0एल",
    subJunctions: [
      "गैस प्लाण्ट",
      "एल0एम0एल चौराहा(समय 09.00 बजे से 17.00 बजे तक)",
    ],
  },
  {
    id: "सचान गेस्ट हाउस / शास्त्री चौक",
    subJunctions: ["सचान गेस्ट हाउस चौराहा", "शास्त्री चौक"],
  },
  {
    id: "नन्दलाल चौराहा",
    subJunctions: ["नन्दलाल चौराहा", "सीटीआई चौराहा"],
  },
  {
    id: "चावला",
    subJunctions: ["चावला चौराहा"],
  },
  {
    id: "वनवे गोविन्दपुरी पुल",
    subJunctions: ["गोविन्द नगर पुराना पुल नीचे"],
  },
  {
    id: "दादानगर/फायर स्टेशन फज0",
    subJunctions: [
      "दादानगर चौराहा",
      "वन वे दादानगर पुल",
      "फायर स्टेशन फज0",
      "मिश्रीलाल चौराहा से वन-वे तक",
    ],
  },
  {
    id: "बारादेवी चौराहा",
    subJunctions: ["बारादेवी चौराहा", "जूही डिपो", "मिलिट्री कैम्प चौराहा"],
  },
  {
    id: "गौशाला चौराहा",
    subJunctions: [
      "गौशाला चौराहा",
      "सोटे बाबा मन्दिर किदवई नगर",
      "गौशाला द्वितीय",
    ],
  },
  {
    id: "बगाही चौराहा/साइड नं0 01 चौराहा",
    subJunctions: [
      "साइड नं0 01 चौराहा",
      "बगाही चौराहा",
      "नयापुल बाबूपुरवा",
      "किदवई नगर चौराहा",
    ],
  },
  {
    id: "घाटमपुर चौराहा",
    subJunctions: ["घाटमपुर चौराहा"],
  },
  {
    id: "घाटमपुर रात्रि",
    subJunctions: ["घाटमपुर चौराहा रात्रि"],
  },
  {
    id: "रमईपुर चौराहा",
    subJunctions: ["रमईपुर चौराहा", "बिधनू नहरिया"],
  },
  {
    id: "मर्चेन्ट चेम्बर",
    subJunctions: [
      "मर्चेन्ट चेम्बर तिराहा",
      "टैफ्को तिराहा",
      "ग्वालटोली कट वीआईपी रोड़",
    ],
  },
  {
    id: "कर्नलगंज चौराहा",
    subJunctions: [
      "कर्नलगंज चौराहा (थाने के सामने वन-वे पर)",
      "लाल इमली चौराहा",
      "सिलवर्टन चौराहा",
    ],
  },
  {
    id: "ग्वालटोली चौराहा",
    subJunctions: [
      "सिलिंग हाउस स्कूल समय 08.00 बजे से 16.00 वजे तक",
      "ग्वालटोली चौराहा",
      "कमाण्ड हाउस गेट",
    ],
  },
  {
    id: "कम्पनी बाग चौराहा",
    subJunctions: [
      "कम्पनी बाग चौराहा",
      "पकडिया तिराहा नबावगंज",
      "गोपाला तिराहा",
      "बेण्डी तिराहा",
      "लिटिल फॉक्स स्कूल तिराहा समय 10:00 से 14:00 बजे व 17.00 से 21.00 तक",
    ],
  },
  {
    id: "राजीव पेट्रोल पम्प",
    subJunctions: [
      "राजीव पेट्रोल पम्प",
      "एलनगंज तिराहा",
      "छः बगलिया चौराहा",
      "आर्य नगर तिराहा",
    ],
  },
  {
    id: "नबावगंज",
    subJunctions: ["चिडियाघर तिराहा", "पहलवानपुर तिराहा", "कर्बला चौराहा"],
  },
  {
    id: "विकास नगर /मैनावती मार्ग",
    subJunctions: ["मैनावती मार्ग तिराहा"],
  },
  {
    id: "रानीघाट तिराहा",
    subJunctions: ["रानीघाट चौराहा", "भैरवघाट चौराहा", "रेव थ्री चौराहा"],
  },
  {
    id: "हैलट तिराहा / आर सी होटल चौराहा",
    subJunctions: [
      "गैस्टोलीवर",
      "आर0सी0 होटल चौराहा",
      "मर्चरी गेट कट यू टर्न",
      "हैलट हास्पिटल तिराहा",
      "हैलट इमरजेन्शी गेट",
      "नरेन्द्र मोहन सेतु",
      "स्वरुप नगर चौराहा",
      "हर्ष नगर चौराहा",
      "मोतीझील",
    ],
  },
  {
    id: "ईदगाह चौराहा/ रामबाग/ब्रह्मनगर",
    subJunctions: [
      "ईदगाह चौराहा",
      "बजरिया वन-वे",
      "बेनाझावर तिराहा",
      "रामबाग चौराहा",
      "ब्रह्मनगर चौराहा",
    ],
  },
  {
    id: "कोकाकोला चौराहा",
    subJunctions: [
      "भारत पेट्रोल पम्प कट(CNG)",
      "कोकाकोला चौराहा",
      "कमला नगर चौराहा",
      "कोकाकोला यू-टर्न (गोल चौराहा साइड)",
      "दक्षिण मुखी हनुमान मन्दिर / पासपोर्ट ऑफिस कट यू-टर्न",
    ],
  },
  {
    id: "गुमटी नं0 05 चौराहा",
    subJunctions: [
      "गुमटी नं0 05 यू-टर्न जरीब चौकी साइड",
      "गुमटी नं0 05 चौराहा",
    ],
  },
  {
    id: "जरीब चौकी चौराहा",
    subJunctions: [
      "जरीब चौकी चौराहा",
      "जरीब चौकी चौराहा (रात्रि)",
      "संगीत टाकीज कट जीटी रोड़",
      "बाँके बिहारी पॉपुलर धर्म काँटा जरीब चौकी",
      "लैनन पार्क",
    ],
  },
  {
    id: "अफीम कोठी चौराह/सीएनजी पम्प/रेलवे स्टेशन कट",
    subJunctions: [
      "अफीम कोठी चौराहा",
      "पोस्ट आॉफिस कट यू-टर्न",
      "अफीम कोठी सीएनजी पम्प",
      "थाना रायपुरवा कट तिराहा",
    ],
  },
  {
    id: "कोपरगंज तिराहा",
    subJunctions: ["कोपरगंज तिराहा"],
  },
  {
    id: "डिप्टीपडाव बांस मण्डी चौराहा",
    subJunctions: [
      "डिप्टी पढाव चौराहा",
      "भारत पेट्रोलियम यूटर्न डिप्टी पडाव (डायवर्जन ड्यूटी)",
      "मन्दिर मोड यू टर्न डिप्टी पडाव (डायवर्जन ड्यूटी)",
      "बांस मण्डी चौराहा",
      "चाचा नेहरू तिराहा",
    ],
  },
  {
    id: "संतनगर चौराहा / गुमटीरोड",
    subJunctions: [
      "संतनगर चौराहा",
      "मरियमपुर चौराहा",
      "चेन फैक्ट्री चौराहा",
      "मनोज पान भण्डार चौराहा",
      "गुर्जर अस्पताल यू टर्न",
      "कैन्डी फ्लास स्कूल यू टर्न",
      "पालीवाल तिराहा",
    ],
  },
  {
    id: "फजलगंज चौराहा",
    subJunctions: ["खोयामण्डी चौराहा", "फजलगंज चौराहा"],
  },
  {
    id: "बीओबी चौराहा",
    subJunctions: ["बीओबी चौराहा", "बस कारखाना"],
  },
  {
    id: "विजय नगर चौराहा/सब्जी मण्डी",
    subJunctions: ["विजय नगर चौराहा", "विजय नगर सब्जी मण्डी"],
  },
  {
    id: "गोल चौराहा/ गुटैय्या क्रासिंग",
    subJunctions: [
      "गुटैय्या क्रसिंग",
      "गुटैैय्या क्रासिंग (रेवमोती मॉल साइड)",
      "गोल चौराहा",
      "हृदय रोग संस्थान कट",
    ],
  },
  {
    id: "नमक फैक्ट्री /डबलपुलिया तिराहा",
    subJunctions: [
      "डबलपुलिया तिराहा",
      "नमक फैक्ट्री चौराहा",
      "नीर क्षीण चौराहा",
      "छपेडा पुलिया",
    ],
  },
  {
    id: "एन्जल हॉस्पिटल तिराहा/ देवकी चौराहा / रेवमोती / डीपीएस स्कूल तिराहा/गुटैया क्रासिंग के पहले/रीजेंशी हास्पिटल",
    subJunctions: [
      "सर्वोदय नगर तिराहा",
      "एन्जल हॉस्पिटल तिराहा",
      "रेवमोती मॉल तिराहा",
      "देवकी चौराहा",
    ],
  },
  {
    id: "रावतपुर तिराहा",
    subJunctions: ["रावतपुर तिराहा", "रावतपुर मैट्रो स्टेशन कट"],
  },
  {
    id: "शारदा नगर/ गीतानगर क्रासिंग",
    subJunctions: [
      "गीता नगर क्रासिंग",
      "शारदा नगर क्रासिंग",
      "शारदा नगर क्रासिंग यू-टर्न",
    ],
  },
];

const fs = require("fs");
const junction_map = junctions.map((e) => e.id);
// const csvContent = junction_map.join(",\n") + "\n";
// Write to CSV file
// const csvFilePath = "sutput.csv";
// fs.writeFileSync(csvFilePath, csvContent);

// console.log(`CSV file '${csvFilePath}' has been successfully written.`);
const subjunction_map = junctions.flatMap((e) => e.subJunctions);
const csvContent = subjunction_map.join(",\n") + "\n";
const csvFilePath = "sutput.csv";
fs.writeFileSync(csvFilePath, csvContent);
